app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts"
---
  def index
    @workouts = Workout.all

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @workout = Workout.find(params[:id])

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @workout = Workout.find(params[:id])

INSERT INTO "workouts" ("MH_suggests", "city", "created_at", "description", "difficulty", "editor_comments", "fitness_tags", "flagged", "gmaps", "latitude", "longitude", "name", "obstacle", "photo_content_type", "photo_file_name", "photo_file_size", "photo_label", "photo_updated_at", "sponsored", "updated_at", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @workout = Workout.new(params[:workout])

    respond_to do |format|
      if @workout.save

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "workouts" SET "photo_file_size" = 53809, "updated_at" = '2011-09-27 00:18:08.208887', "photo_updated_at" = '2011-09-27 00:18:07.476568', "photo_file_name" = 'house mc.jpg' WHERE "workouts"."id" = 4
---
  def update
    @workout = Workout.find(params[:id])

    respond_to do |format|
      if @workout.update_attributes(params[:workout])

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 1]]
---
  def destroy
    @workout = Workout.find(params[:id])
    @workout.destroy